#include <iostream>
using namespace std;

int task1()
{
    // Завдання 1 (39), км/год в м/с
    double k, m;
    cout << "Швидкість з км/год у м/с.\nВведіть швидкість в км/год: ";
    if (!(cin >> k)) { cout << "недопустиме значення\n"; cin.clear(); return 0;} // ввід початкового значення
    m = k / 3.6;    // розрахунок значення в м/с
    cout << m << " м/с\n";    // виведення результату
    return 0;
}


int task2()
{
    // Завдання 2 (19), Покрокове обчислення А^15, 5ма діями з 2 дот змінних
    long a, a1, a2;
    cout << "Покрокове  обчислення А^15.\nВведіть А: ";
    if (!(cin >> a)) { cout << "недопустиме значення\n"; cin.clear(); return 0;}  // ввід початкового значення
    // покроковий розрахунок з виводом
    a1 = a * a;
    cout << a1 << endl;
    a2 = a1 * a;
    cout << a2 << endl;
    a2 = a1 * a2;
    cout << a2 << endl;
    a1 = a2 * a2;
    cout << a2 << endl;
    a1 = a1 * a2;
    // вивід результату
    cout << a << "^15: " << a1 << endl;
    return 0;
}

int task3()
{
    // Завдання 3 (14), переміщення данних  A => B, B => C, C => A.
    int a = 1, b = 2, c = 3, n;
    cout << "введіть a, b, c\n";
    cin >> a >> b >> c; // введення змінних
    cout << "a: " << a << " b: " << b << " c: " << c;
    // переміщення вмісту
    n = a;
    a = c;
    c = b;
    b = n;
    cout << "\na: " << a << " b: " << b << " c: " << c; // виведення результату
    return 0;
}

int main()
{
    // невеликий селектор завданнь й опис
    cout << "Лабораторна робота No1, Христич З.О.\nВведіть ==>\nlist - для списку завданнь\n1-3 запуск завдання\n";
    string command;
    while(true) {

        cin >> command;
        if (command == "list") {
            cout << "\nЗавдання 1 (39), км/год в м/с\nЗавдання 2 (19), Покрокове обчислення А^15, 5ма діями з 2 дот змінних\nЗавдання 3 (14), переміщення данних  A => B, B => C, C => A.\n";
        }
        else if (command == "1") { task1();}
        else if  (command == "2") { task2();}
        else if  (command == "3") { task3();}
        else { cout << "недопустимий ввід.\n";}
    };
    return 0;
}