#include <iostream>
using namespace std;

int main()
{
    // Завдання 1 (39)
    // Переведення швидкості з км/год у м/с

    // декларація змінних
    double k, m;

    // виведення назви задачі та запрошення до вводу
    cout << "Завдання 1 (39)\n";
    cout << "Переведення швидкості з км/год у м/с.\n";
    cout << "Введіть швидкість в км/год: ";

    // введення початкового значення
    cin >> k;

    // розрахунок результату
    m = k * (1000 / 3600);

    // виведення результату
    cout << "Швидкість у м/с: " << m << endl;


    // Завдання 2 (19)
    // Покрокове обчислення A^15

    // декларація змінних
    long a, a1, a2;

    // виведення назви задачі та запрошення до вводу
    cout << "\nЗавдання 2 (19)\n";
    cout << "Покрокове обчислення A^15.\n";
    cout << "Введіть A: ";

    // введення початкового значення
    cin >> a;

    // обчислення A^2
    a1 = a * a;
    cout << "A^2 = " << a1 << endl;

    // обчислення A^3
    a2 = a1 * a;
    cout << "A^3 = " << a2 << endl;

    // обчислення A^5
    a2 = a2 * a1;
    cout << "A^5 = " << a2 << endl;

    // обчислення A^10
    a1 = a2 * a2;
    cout << "A^10 = " << a1 << endl;

    // обчислення A^15
    a1 = a1 * a2;
    cout << "A^15 = " << a1 << endl;


    // Завдання 3 (14)
    // Переміщення A => B, B => C, C => A

    // декларація змінних
    int A, B, C, n;

    // виведення назви задачі та запрошення до вводу
    cout << "\nЗавдання 3 (14)\n";
    cout << "Переміщення вмісту A => B, B => C, C => A\n";
    cout << "Введіть A, B, C: ";

    // введення початкових значень
    cin >> A >> B >> C;

    // виведення початкових значень
    cout << "\nПочаткові значення:\n";
    cout << "A = " << A << " B = " << B << " C = " << C << endl;

    // збереження початкового значення A
    n = A;

    // переміщення значень
    A = C;
    C = B;
    B = n;

    // виведення нових значень
    cout << "\nНові значення:\n";
    cout << "A = " << A << " B = " << B << " C = " << C << endl;

    return 0;
}
